Revit 2027 API
LineLoad.Create Method
Overload List
Name | Description
Create(Document, ElementId, XYZ, XYZ, LineLoadType) |  Creates a new hosted line load within the project.
Create(Document, ElementId, Curve, XYZ, XYZ, LineLoadType) |  Creates a new custom line load within the project.
Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType) |  Creates a new hosted line load within the project.
Top
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace